Show / Hide Table of Contents
Class OpeningRect
Representation of rectangular opening in IDEA StatiCa Detail
Inheritance
System.Object
OpenObject
OpenElementId
Opening
OpeningRect
Inherited Members
 Opening.Name
 Opening.GeomId
 Opening.MasterComponent
 Opening.MasterPoint
 Opening.InsertPoint
 Opening.Outline
 Opening.Position
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Detail
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass(typeof(Opening))]
public class OpeningRect : Opening
Constructors
Improve this Doc   View Source
OpeningRect()
Constructor
Declaration
public OpeningRect()
Properties
Improve this Doc   View Source
Height
Height of wall
Declaration
public double Height { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Width
Width of wall
Declaration
public double Width { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source